sterentev/atdf-device-asm-include/inc/ATmega16HVBrevB.inc
; ----------	Register CADRDC bits		------------------------
.equ	CADRDC_MASK	= 0xFF		;      - CC-ADC Regular Discharge Current (8 bits)
.equ	CADRDC0		= 0		;          CADRDC BIT0 position



; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWBCSR bits		------------------------
.equ	TWBCIF		= 7		; 0x80 - TWI Bus Connect/Disconnect Interrupt Flag
.equ	TWBCIE		= 6		; 0x40 - TWI Bus Connect/Disconnect Interrupt Enable
.equ	TWBDT_MASK	= 0x06		;      - TWI Bus Disconnect Time-out Period (2 bits)
.equ	TWBDT0		= 1		;          TWBDT BIT0 position
.equ	TWBCIP		= 0		; 0x01 - TWI Bus Connect/Disconnect Interrupt Polarity
; ::::  TWBDT	:::: bitfield values
;			0x00		; 250ms
;			0x02		; 500ms
;			0x04		; 1000ms
;			0x06		; 2000ms

; ----------	Register TWAMR bits		------------------------
.equ	TWAM_MASK	= 0xFE		;      -  (7 bits)
.equ	TWAM0		= 1		;          TWAM BIT0 position

; ----------	Register TWBR bits		------------------------
.equ	TWBR_MASK	= 0xFF		;      - TWI Bit Rate bits (8 bits)
.equ	TWBR0		= 0		;          TWBR BIT0 position

; ----------	Register TWCR bits		------------------------
.equ	TWINT		= 7		; 0x80 - TWI Interrupt Flag
.equ	TWEA		= 6		; 0x40 - TWI Enable Acknowledge Bit
.equ	TWSTA		= 5		; 0x20 - TWI Start Condition Bit
.equ	TWSTO		= 4		; 0x10 - TWI Stop Condition Bit
.equ	TWWC		= 3		; 0x08 - TWI Write Collision Flag
.equ	TWEN		= 2		; 0x04 - TWI Enable Bit
.equ	TWIE		= 0		; 0x01 - TWI Interrupt Enable

; ----------	Register TWSR bits		------------------------
.equ	TWS_MASK	= 0xF8		;      - TWI Status (5 bits)
.equ	TWS0		= 3		;          TWS BIT0 position
.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler (2 bits)
.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWDR bits		------------------------
.equ	TWD_MASK	= 0xFF		;      - TWI Data Bits (8 bits)
.equ	TWD0		= 0		;          TWD BIT0 position

; ----------	Register TWAR bits		------------------------
.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address register Bits (7 bits)
.equ	TWA0		= 1		;          TWA BIT0 position
.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt Sense Control 3 Bits (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control 2 Bits (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control 1 Bits (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control 0 Bits (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x40		; Any Logical Change of INTX
;			0x80		; Falling Edge of INTX
;			0xC0		; Rising Edge of INTX
; ::::  ISC2	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x10		; Any Logical Change of INTX
;			0x20		; Falling Edge of INTX
;			0x30		; Rising Edge of INTX
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change of INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change of INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0x0F		;      - External Interrupt Request 3 Enable (4 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0x0F		;      - External Interrupt Flags (4 bits)
.equ	INTF0		= 0		;          INTF BIT0 position

; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x03		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x03		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

; ----------	Register PCMSK1 bits		------------------------
.equ	PCMSK1_PCINT_MASK= 0xFF		;      - Pin Change Enable Mask (8 bits)
.equ	PCMSK1_PCINT0	= 0		;          PCMSK1_PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
.equ	PCMSK0_PCINT_MASK= 0x0F		;      - Pin Change Enable Mask (4 bits)
.equ	PCMSK0_PCINT0	= 0		;          PCMSK0_PCINT BIT0 position



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR1B bits		------------------------
.equ	CS_MASK		= 0x07		;      - Clock Select1 bis (3 bits)
.equ	CS0		= 0		;          CS BIT0 position
; ::::  CS	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR1A bits		------------------------
.equ	TCW1		= 7		; 0x80 - Timer/Counter Width
.equ	ICEN1		= 6		; 0x40 - Input Capture Mode Enable
.equ	ICNC1		= 5		; 0x20 - Input Capture Noise Canceler
.equ	ICES1		= 4		; 0x10 - Input Capture Edge Select
.equ	ICS1		= 3		; 0x08 - Input Capture Select
.equ	WGM10		= 0		; 0x01 - Waveform Generation Mode

; ----------	Register TCNT1 bits		------------------------
.equ	TCNT1_MASK	= 0xFFFF	;      - Timer Counter 1 bits (16 bits)
.equ	TCNT10		= 0		;          TCNT1 BIT0 position

; ----------	Register OCR1A bits		------------------------
.equ	OCR1A_MASK	= 0xFF		;      - Output Compare 1 A bits (8 bits)
.equ	OCR1A0		= 0		;          OCR1A BIT0 position

; ----------	Register OCR1B bits		------------------------
.equ	OCR1B_MASK	= 0xFF		;      - Output Compare 1 B bits (8 bits)
.equ	OCR1B0		= 0		;          OCR1B BIT0 position

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 3		; 0x08 - Timer/Counter n Input Capture Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

