sterentev/atdf-device-asm-include/inc/ATmega16HVBrevB.inc
; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 3		; 0x08 - Timer/Counter 1 Input Capture Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare Flag B
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare Flag A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset

; ----------	Register TCCR0B bits		------------------------
.equ	CS02		= 2		; 0x04 - Clock Select0 bit 2
.equ	CS01		= 1		; 0x02 - Clock Select0 bit 1
.equ	CS00		= 0		; 0x01 - Clock Select0 bit 0
; ::::  CS00	>>>> This is a part of CLK_SEL_3BIT_EXT enum (see complete values list below)

; ----------	Register TCCR0A bits		------------------------
.equ	TCW0		= 7		; 0x80 - Timer/Counter Width
.equ	ICEN0		= 6		; 0x40 - Input Capture Mode Enable
.equ	ICNC0		= 5		; 0x20 - Input Capture Noise Canceler
.equ	ICES0		= 4		; 0x10 - Input Capture Edge Select
.equ	ICS0		= 3		; 0x08 - Input Capture Select
.equ	WGM00		= 0		; 0x01 - Waveform Generation Mode

; ----------	Register TCNT0 bits		------------------------
.equ	TCNT0_MASK	= 0xFFFF	;      - Timer Counter 0 bits (16 bits)
.equ	TCNT00		= 0		;          TCNT0 BIT0 position

; ----------	Register OCR0A bits		------------------------
.equ	OCR0A_MASK	= 0xFF		;      - Output Compare 0 A bits (8 bits)
.equ	OCR0A0		= 0		;          OCR0A BIT0 position

; ----------	Register OCR0B bits		------------------------
.equ	OCR0B_MASK	= 0xFF		;      - Output Compare 0 B bits (8 bits)
.equ	OCR0B0		= 0		;          OCR0B BIT0 position

; ----------	Register TIMSK0 bits		------------------------
.equ	ICIE0		= 3		; 0x08 - Timer/Counter n Input Capture Interrupt Enable
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	ICF0		= 3		; 0x08 - Timer/Counter 0 Input Capture Flag
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset



; ====	CELL_BALANCING MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register CBCR bits		------------------------
.equ	CBE_MASK	= 0x0F		;      - Cell Balancing Enables (4 bits)
.equ	CBE0		= 0		;          CBE BIT0 position



; ====	BATTERY_PROTECTION MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register BPPLR bits		------------------------
.equ	BPPLE		= 1		; 0x02 - Battery Protection Parameter Lock Enable
.equ	BPPL		= 0		; 0x01 - Battery Protection Parameter Lock

; ----------	Register BPCR bits		------------------------
.equ	EPID		= 5		; 0x20 - External Protection Input Disable
.equ	SCD		= 4		; 0x10 - Short Circuit Protection Disabled
.equ	DOCD		= 3		; 0x08 - Discharge Over-current Protection Disabled
.equ	COCD		= 2		; 0x04 - Charge Over-current Protection Disabled
.equ	DHCD		= 1		; 0x02 - Discharge High-current Protection Disable
.equ	CHCD		= 0		; 0x01 - Charge High-current Protection Disable

; ----------	Register BPHCTR bits		------------------------
.equ	HCPT_MASK	= 0x3F		;      - Battery Protection Short-current Timing bits (6 bits)
.equ	HCPT0		= 0		;          HCPT BIT0 position

; ----------	Register BPOCTR bits		------------------------
.equ	OCPT_MASK	= 0x3F		;      - Battery Protection Over-current Timing bits (6 bits)
.equ	OCPT0		= 0		;          OCPT BIT0 position

; ----------	Register BPSCTR bits		------------------------
.equ	SCPT_MASK	= 0x7F		;      - Battery Protection Short-current Timing bits (7 bits)
.equ	SCPT0		= 0		;          SCPT BIT0 position

; ----------	Register BPCHCD bits		------------------------
.equ	CHCDL_MASK	= 0xFF		;      - Battery Protection Charge-High-current Detection Level bits (8 bits)
.equ	CHCDL0		= 0		;          CHCDL BIT0 position

; ----------	Register BPDHCD bits		------------------------
.equ	DHCDL_MASK	= 0xFF		;      - Battery Protection Discharge-High-current Detection Level bits (8 bits)
.equ	DHCDL0		= 0		;          DHCDL BIT0 position

; ----------	Register BPCOCD bits		------------------------
.equ	COCDL_MASK	= 0xFF		;      - Battery Protection Charge-Over-current Detection Level bits (8 bits)
.equ	COCDL0		= 0		;          COCDL BIT0 position

; ----------	Register BPDOCD bits		------------------------
.equ	DOCDL_MASK	= 0xFF		;      - Battery Protection Discharge-Over-current Detection Level bits (8 bits)
.equ	DOCDL0		= 0		;          DOCDL BIT0 position

; ----------	Register BPSCD bits		------------------------
.equ	SCDL_MASK	= 0xFF		;      - Battery Protection Short-Circuit Detection Level Register bits (8 bits)
.equ	SCDL0		= 0		;          SCDL BIT0 position

; ----------	Register BPIFR bits		------------------------
.equ	SCIF		= 4		; 0x10 - Short-circuit Protection Activated Interrupt Flag
.equ	DOCIF		= 3		; 0x08 - Discharge Over-current Protection Activated Interrupt Flag
.equ	COCIF		= 2		; 0x04 - Charge Over-current Protection Activated Interrupt Flag
.equ	DHCIF		= 1		; 0x02 - Discharge High-current Protection Activated Interrupt
.equ	CHCIF		= 0		; 0x01 - Charge High-current Protection Activated Interrupt

; ----------	Register BPIMSK bits		------------------------
.equ	SCIE		= 4		; 0x10 - Short-circuit Protection Activated Interrupt Enable
.equ	DOCIE		= 3		; 0x08 - Discharge Over-current Protection Activated Interrupt Enable
.equ	COCIE		= 2		; 0x04 - Charge Over-current Protection Activated Interrupt Enable
.equ	DHCIE		= 1		; 0x02 - Discharger High-current Protection Activated Interrupt
.equ	CHCIE		= 0		; 0x01 - Charger High-current Protection Activated Interrupt



; ====	CHARGER_DETECT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register CHGDCSR bits		------------------------
.equ	BATTPVL		= 4		; 0x10 - BATT Pin Voltage Level
.equ	CHGDISC_MASK	= 0x0C		;      - Charger Detect Interrupt Sense Control (2 bits)
.equ	CHGDISC0	= 2		;          CHGDISC BIT0 position
.equ	CHGDIF		= 1		; 0x02 - Charger Detect Interrupt Flag
.equ	CHGDIE		= 0		; 0x01 - Charger Detect Interrupt Enable



; ====	VOLTAGE_REGULATOR MODULE REGISTERS BITS DEFINITION========
;
; ----------	Register ROCR bits		------------------------
.equ	ROCS		= 7		; 0x80 - ROC Status
.equ	ROCD		= 4		; 0x10 - ROC Disable
.equ	ROCWIF		= 1		; 0x02 - ROC Warning Interrupt Flag
.equ	ROCWIE		= 0		; 0x01 - ROC Warning Interrupt Enable



