sterentev/atdf-device-asm-include/inc/ATmega16HVBrevB.inc
; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		reti			; BPINT		 - Battery Protection Interrupt
;#		reti			; VREGMON	 - Voltage regulator monitor interrupt
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; INT2		 - External Interrupt Request 2
;#		reti			; INT3		 - External Interrupt Request 3
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt 0
;#		reti			; PCINT1	 - Pin Change Interrupt 1
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		reti			; BGSCD		 - Bandgap Buffer Short Circuit Detected
;#		reti			; CHDET		 - Charger Detect
;#		reti			; TIMER1_IC	 - Timer 1 Input capture
;#		reti			; TIMER1_COMPA	 - Timer 1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer 1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer 1 overflow
;#		reti			; TIMER0_IC	 - Timer 0 Input Capture
;#		reti			; TIMER0_COMPA	 - Timer 0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer 0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer 0 Overflow
;#		reti			; TWIBUSCD	 - Two-Wire Bus Connect/Disconnect
;#		reti			; TWI		 - Two-Wire Serial Interface
;#		reti			; SPI_STC	 - SPI Serial transfer complete
;#		reti			; VADC		 - Voltage ADC Conversion Complete
;#		reti			; CCADC_CONV	 - Coulomb Counter ADC Conversion Complete
;#		reti			; CCADC_REG_CUR	 - Coloumb Counter ADC Regular Current
;#		reti			; CCADC_ACC	 - Coloumb Counter ADC Accumulator
;#		rjmp	INT_EE_READY	; EE_READY	 - EEPROM Ready
;#		reti			; SPM		 - SPM Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA16HVBREVB_INC_ */

; ************************ END OF FILE *********************************

